[
  {
    "id": 0,
    "name": "Avocado Toast",
    "description": "Toasted bread topped with mashed avocado, seasoned with salt, pepper, and a splash of citrus juice. Customize with toppings like tomatoes or poached eggs for a quick and tasty meal.",
    "ingredients": [
      {
        "1 raw avocado": 2344719,
        "2 slices of bread": 2340763,
        "Salt and pepper": 2342183
      }
    ],
    "instructions": [
      "Begin by slicing the avocado in half, removing the pit, and scooping out the flesh into a bowl.",
      "Using a fork, mash the avocado to your desired consistency. Add salt and pepper to taste.",
      "Toast the bread slices to your preferred level of crispiness.",
      "Spread the mashed avocado evenly over each slice of toast.",
      "If desired, add your choice of optional toppings like a poached or fried egg, cherry tomatoes, red pepper flakes, feta cheese, or a drizzle of balsamic glaze.",
      "Serve immediately and enjoy your delicious avocado toast!"
    ],
    "image": "/images/avocado-toast.png"
  },
  {
    "id": 1,
    "name": "Avocado Smoothie",
    "description": "Blend ripe avocado with banana, spinach, Greek yogurt, and a splash of almond milk for a creamy and nutritious beverage. This green delight offers a balance of flavors and a boost of vitamins, making it a refreshing and wholesome choice for a quick and easy smoothie.",
    "ingredients": [
      {
        "1 raw avocado": 2344719,
        "1 ripe banana": 2344859,
        "1 cup spinach": 2345170,
        "1/2 cup Greek yogurt": 2340822,
        "1 cup almond milk": 2340764,
        "1 tablespoon honey": 2340764,
        "1/2 teaspoon vanilla extract": 2345533,
        "Ice cubes": 2341231
      }
    ],
    "instructions": [
      "Combine the peeled and pitted avocado, milk, yogurt, honey, and vanilla extract in a blender.",
      "Blend the mixture until smooth. If the smoothie is too thick, you can add a bit more milk to reach your desired consistency.",
      "If using, add ice cubes to the blender and blend again until the smoothie is chilled and frothy.",
      "Taste and adjust the sweetness if necessary, by adding more honey.",
      "Pour the smoothie into glasses.",
      "Garnish with fresh mint leaves if desired.",
      "Serve immediately and enjoy your refreshing avocado smoothie!"
    ],
    "image": "/images/avocado_milkshake.jpg"
  },
  {
    "id": 2,
    "name": "Bacon Guac Bomb",
    "description": "A savory delight featuring crispy bacon wrapped around a creamy guacamole center. These flavor-packed bites are perfect for a party or a tasty snack. The combination of smoky bacon and zesty guacamole creates an explosion of taste in every bite.",
    "ingredients": [
      {
        "2 raw avocados": 2344719,
        "2-3 slices of cooked bacon": 2341261,
        "1/2 small red onion": 2345315,
        "1 Roma tomato": 2340764,
        "1 clove garlic": 2340764,
        "1 tbsp lime juice": 2344680,
        "1/4 cup cilantro": 2345302,
        "Salt and pepper": 2342183,
        "1/2 jalapeño": 2343768,
        "1/4 tsp ground cumin": 2341259,
        "Crushed red pepper flakes": 2345500
      }
    ],
    "instructions": [
      "In a medium bowl, mash the avocados to your desired consistency.",
      "Add the crumbled bacon, red onion, Roma tomato, garlic, lime juice, and cilantro to the mashed avocados.",
      "Season the mixture with salt and pepper. Stir well to combine all the ingredients.",
      "For a spicy kick, add the minced jalapeño and ground cumin, if using.",
      "Mix everything thoroughly.",
      "Taste and adjust the seasoning as needed.",
      "Transfer the guacamole to a serving dish.",
      "Garnish with crushed red pepper flakes, if desired.",
      "Serve immediately with your favorite chips or as a side dish. Enjoy your flavorful Bacon Guac Bomb!"
    ],
    "image": "/images/bacon-guac-bombs.jpg"
  },
  {
    "id": 3,
    "name": "Avocado Salad",
    "description": "A refreshing mix of ripe avocados, cherry tomatoes, cucumber, and red onion tossed in a zesty vinaigrette dressing. This vibrant salad offers a perfect balance of creamy and crunchy textures, making it a light and flavorful dish suitable for any meal. Customize with herbs or feta cheese for an extra burst of flavor.",
    "ingredients": [
      {
        "2 raw avocados": 2344719,
        "1 cucumber": 2345341,
        "1 cup cherry tomatoes": 2340764,
        "1/4 red onion": 2345315,
        "1/2 cup corn kernels": 2346074,
        "1/2 red bell pepper": 2345500,
        "1/4 cup cilantro": 2345302,
        "Juice of 1 lime": 2344680,
        "2 tbsp olive oil": 2345743,
        "Salt and pepper": 2342183,
        "1/4 cup crumbled feta cheese": 2341117,
        "2 tbsp pumpkin seeds": 2343055
      }
    ],
    "instructions": [
      "In a large salad bowl, combine the sliced avocados, cucumber, cherry tomatoes, red onion, corn kernels, and red bell pepper.",
      "Add the chopped cilantro to the bowl.",
      "In a small bowl, whisk together the lime juice, olive oil, salt, and pepper to create the dressing.",
      "Pour the dressing over the salad and gently toss to coat the ingredients evenly.",
      "If desired, sprinkle the salad with crumbled feta cheese and pumpkin seeds or sunflower seeds for added texture and flavor.",
      "Serve the salad immediately, or chill in the refrigerator for a refreshing and healthy meal or side dish.",
      "Enjoy your vibrant and tasty Avocado Salad!"
    ],
    "image": "/images/avocado-salad.jpg"
  },
  {
    "id": 4,
    "name": "Fried Avocado Bites",
    "description": "Crispy on the outside, creamy on the inside – these bite-sized treats feature slices of avocado coated in a seasoned breadcrumb or batter, then fried to golden perfection. Served with a zesty dipping sauce, these indulgent bites are a delicious combination of textures and flavors, making them a delightful appetizer or snack.",
    "ingredients": [
      {
        "2 raw avocados": 2344719,
        "1 cup all-purpose flour": 2343304,
        "2 large eggs": 2342356,
        "1 cup panko breadcrumbs": 2340764,
        "1 tsp garlic powder": 2340953,
        "1 tsp paprika": 2340764,
        "Salt and pepper": 2342183,
        "Vegetable oil": 2345737
      }
    ],
    "instructions": [
      "Set up a breading station with three bowls: one for flour, one for beaten eggs, and one for panko breadcrumbs mixed with garlic powder, paprika, salt, and pepper.",
      "Coat each avocado piece first in flour, then dip in the beaten eggs, and finally coat with the panko mixture, pressing gently to adhere.",
      "Heat vegetable oil in a frying pan over medium heat. You'll need enough oil to cover the bottom of the pan.",
      "Once the oil is hot, fry the avocado bites in batches, being careful not to overcrowd the pan. Fry until they are golden and crispy, about 2-3 minutes per side.",
      "Use a slotted spoon to transfer the fried avocado bites to a plate lined with paper towels to drain excess oil.",
      "Serve the fried avocado bites hot with your choice of dipping sauce, such as ranch dressing, aioli, or hot sauce.",
      "Enjoy your delicious and crispy Fried Avocado Bites!"
    ],
    "image": "/images/avocado-bites.jpg"
  },
  {
    "id": "5",
    "name": "California Sushi Roll",
    "description": "A classic sushi roll filled with imitation crab, avocado, and cucumber. Wrapped in seaweed and rice, and often topped with sesame seeds, this iconic roll is a fusion of creamy avocado, sweet crab, and refreshing cucumber. Served with soy sauce and wasabi, the California Roll is a popular and accessible choice for sushi enthusiasts.",
    "ingredients": [
      {
        "2 cups sushi rice": 2344444,
        "4 sheets nori (seaweed)": 2345648,
        "1/2 cucumber": 2345341,
        "1 raw avocado": 2344719,
        "8 crab sticks": 2341759,
        "1 tbsp sesame seeds": 2343061,
        "Soy sauce": 2342917,
        "Wasabi": 2345630,
        "Pickled ginger": 2345609
      }
    ],
    "instructions": [
      "Lay a sheet of nori on a bamboo sushi mat. Spread a thin layer of sushi rice over the nori, leaving about a half-inch border at the top.",
      "Place a few pieces of cucumber, avocado slices, and 2 crab sticks near the bottom edge of the rice.",
      "Carefully start rolling the sushi using the bamboo mat, pressing gently but firmly. Roll it away from you until you reach the end of the nori.",
      "Wet the top border slightly with water to seal the roll.",
      "With a sharp knife, cut the roll into six equal pieces. Wetting the knife between cuts will make slicing easier.",
      "Sprinkle the rolls with sesame seeds if desired.",
      "Serve the California rolls with soy sauce, wasabi, and pickled ginger on the side.",
      "Enjoy your delicious homemade California Sushi Rolls!"
    ],
    "image": "/images/california-roll.jpg"
  },
  {
    "id": "6",
    "name": "Grilled Avocados",
    "description": "Halved avocados lightly brushed with olive oil, seasoned with salt and pepper, and grilled until they develop a smoky char. The heat enhances the natural creaminess of the avocado while adding a hint of smokiness. Grilled avocados can be enjoyed on their own, as a side dish, or incorporated into various recipes, offering a unique twist to the beloved fruit.",
    "ingredients": [
      {
        "2 raw avocados": 2344719,
        "1 tbsp olive oil": 2345743,
        "Juice of 1 lime": 2344680,
        "Salt and pepper": 2342183,
        "1/4 cup diced tomatoes": 2345232,
        "1/4 cup diced red onion": 2345315,
        "1 tbsp chopped cilantro": 2345302,
        "1 clove garlic": 2340764
      }
    ],
    "instructions": [
      "Preheat your grill to medium-high heat.",
      "Brush the cut sides of the avocados with olive oil and season with salt and pepper.",
      "Place the avocados, cut side down, on the grill. Grill for about 5-7 minutes, or until they have nice grill marks and are slightly softened.",
      "While the avocados are grilling, mix together diced tomatoes, red onion, cilantro, and minced garlic in a bowl. Squeeze the lime juice over the mixture and stir to combine.",
      "Once the avocados are grilled, remove them from the grill and fill the cavities with the tomato-onion mixture.",
      "If desired, garnish with crumbled feta or cotija cheese.",
      "For an extra flavor, drizzle balsamic glaze or your choice of dressing over the filled avocados.",
      "Serve immediately and enjoy your flavorful Grilled Avocados!"
    ],
    "image": "/images/grilled-avocado.jpg"
  },
  {
    "id": "7",
    "name": "Fried Avocado Bites",
    "description": "Crispy on the outside, creamy on the inside – these bite-sized treats feature slices of avocado coated in a seasoned breadcrumb or batter, then fried to golden perfection. Served with a zesty dipping sauce, these indulgent bites are a delicious combination of textures and flavors, making them a delightful appetizer or snack.",
    "ingredients": [
      {
        "2 raw avocados": 2344719,
        "1 cup all-purpose flour": 2343304,
        "2 large eggs": 2342356,
        "1 cup panko breadcrumbs": 2340764,
        "1 tsp garlic powder": 2340953,
        "1 tsp paprika": 2340764,
        "Salt and pepper": 2342183,
        "Vegetable oil": 2345737
      }
    ],
    "instructions": [
      "Set up a breading station with three bowls: one for flour, one for beaten eggs, and one for panko breadcrumbs mixed with garlic powder, paprika, salt, and pepper.",
      "Coat each avocado piece first in flour, then dip in the beaten eggs, and finally coat with the panko mixture, pressing gently to adhere.",
      "Heat vegetable oil in a frying pan over medium heat. You'll need enough oil to cover the bottom of the pan.",
      "Once the oil is hot, fry the avocado bites in batches, being careful not to overcrowd the pan. Fry until they are golden and crispy, about 2-3 minutes per side.",
      "Use a slotted spoon to transfer the fried avocado bites to a plate lined with paper towels to drain excess oil.",
      "Serve the fried avocado bites hot with your choice of dipping sauce, such as ranch dressing, aioli, or hot sauce.",
      "Enjoy your delicious and crispy Fried Avocado Bites!"
    ],
    "image": "/images/avocado-transparent.png"
  }
]